app/Controllers/Dashboard.php

        }

        // Update metadata
        $this->uploadModel->update($uploadId, [
            'upload_name' => $uploadName,
            'quarter' => $quarter,
            'year' => $year,
            'usd_value' => $usdValue,
            'status' => 'processing'
        ]);
---
UPDATE `uploads` SET `upload_name` = 'Test', `quarter` = '2', `year` = '2025', `usd_value` = '16653', `status` = 'processing'
WHERE `uploads`.`id` IN ('34')