app/Controllers/SecurityMonitoring.php

    public function getThreats()
    {
        try {
            $db = \Config\Database::connect();

            // 24 jam terakhir
            $threats = $db->table('security_logs')
                ->where('created_at >=', date('Y-m-d H:i:s', strtotime('-24 hours')))
                ->orderBy('created_at', 'DESC')
                ->limit(100)
                ->get()
                ->getResultArray();

            $today = date('Y-m-d');

            $total = $db->table('security_logs')
                ->where('DATE(created_at)', $today)
                ->countAllResults();

            $blocked = $db->table('security_logs')
                ->where('DATE(created_at)', $today)
                ->where('status', 'blocked')
                ->countAllResults();

            $critical = $db->table('security_logs')
                ->where('DATE(created_at)', $today)
                ->where('severity', 'critical')
                ->countAllResults();
---
SELECT *
FROM `security_logs`
WHERE `created_at` >= '2025-12-03 16:02:57'
ORDER BY `created_at` DESC
 LIMIT 100
SELECT COUNT(*) AS `numrows`
FROM `security_logs`
WHERE DATE(created_at) = '2025-12-04'
SELECT COUNT(*) AS `numrows`
FROM `security_logs`
WHERE DATE(created_at) = '2025-12-04'
AND `status` = 'blocked'
SELECT COUNT(*) AS `numrows`
FROM `security_logs`
WHERE DATE(created_at) = '2025-12-04'
AND `severity` = 'critical'


            $trend = $this->getTrendData($db);

            $threatTypes = $db->table('security_logs')
                ->select('type, COUNT(*) as count')
                ->where('created_at >=', date('Y-m-d H:i:s', strtotime('-24 hours')))
                ->groupBy('type')
                ->orderBy('count', 'DESC')
                ->get()
                ->getResultArray();
---
SELECT `type`, COUNT(*) as count
FROM `security_logs`
WHERE `created_at` >= '2025-12-03 16:02:57'
GROUP BY `type`
ORDER BY `count` DESC

    private function getTrendData($db)
    {
        $data = [];
        for ($i = 23; $i >= 0; $i--) {
            $hourLabel = date('H:00', strtotime("-$i hours"));
            $startTime = date('Y-m-d H:00:00', strtotime("-" . ($i + 1) . " hours"));
            $endTime = date('Y-m-d H:00:00', strtotime("-$i hours"));

            $total = $db->table('security_logs')
                ->where('created_at >=', $startTime)
                ->where('created_at <', $endTime)
                ->countAllResults();

            $blocked = $db->table('security_logs')
                ->where('created_at >=', $startTime)
                ->where('created_at <', $endTime)
                ->where('status', 'blocked')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `security_logs`
WHERE `created_at` >= '2025-12-03 16:00:00'
AND `created_at` < '2025-12-03 17:00:00'
SELECT COUNT(*) AS `numrows`
FROM `security_logs`
WHERE `created_at` >= '2025-12-03 16:00:00'
AND `created_at` < '2025-12-03 17:00:00'
AND `status` = 'blocked'