app/Controllers/UserManagement.php

    public function store()
    {
        $rules = [
            'username' => 'required|min_length[3]|max_length[100]|is_unique[users.username]|alpha_numeric',
            'name' => 'required|min_length[3]|max_length[100]',
            'email' => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[8]',
            'role' => 'required|in_list[admin,user]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $data = [
            'username' => $this->request->getPost('username'),
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'password' => $this->userModel->hashPassword($this->request->getPost('password')),
            'role' => $this->request->getPost('role'),
            'status' => 'active',
        ];

        if ($this->userModel->insert($data)) {
---
INSERT INTO `users` (`username`, `email`, `password`, `role`, `status`, `created_at`, `updated_at`) VALUES ('tst', 'tst@gmail.com', '$2y$12$Ca8qtn5dHYh4hhxiNL3uf.01lJiepEHi1k4H0S.Or00ahzAs1SKpq', 'user', 'active', '2026-01-22 20:07:50', '2026-01-22 20:07:50')