app/Models/ProjectModel.php

SELECT `country`, COUNT(*) as count
FROM `projects`
WHERE `upload_id` = 64
AND `investment_type` = 'PMA'
AND `country` IS NOT NULL
AND `country` != ''
GROUP BY `country`
ORDER BY `count` DESC
---
    public function getProjectsByCountry($uploadId, $filters = [])
    {
        // For now, we'll use direct calculation with filters since pre-calculated stats don't support filtering (PMA only)
        $builder = $this->select('country, COUNT(*) as count')
            ->where('upload_id', $uploadId)
            ->where('investment_type', 'PMA')
            ->where('country IS NOT NULL')
            ->where('country !=', '');

        if (!empty($filters['quarter']) && $filters['quarter'] !== 'all') {
            $builder->where('period_stage', $filters['quarter']);
        }

        $result = $builder->groupBy('country')->orderBy('count', 'DESC')->findAll();

SELECT `subdistrict`, COUNT(*) as total_projects
FROM `projects`
WHERE `upload_id` = 64
AND `subdistrict` IS NOT NULL
AND `subdistrict` != ''
GROUP BY `subdistrict`
ORDER BY `total_projects` DESC
---
    public function getRankingByDistrict($uploadId, $filters = [])
    {
        // For now, we'll use direct calculation with filters since pre-calculated stats don't support filtering
        $builder = $this->select('subdistrict, COUNT(*) as total_projects')
            ->where('upload_id', $uploadId)
            ->where('subdistrict IS NOT NULL')
            ->where('subdistrict !=', '');

        if (!empty($filters['quarter']) && $filters['quarter'] !== 'all') {
            $builder->where('period_stage', $filters['quarter']);
        }

        $result = $builder->groupBy('subdistrict')->orderBy('total_projects', 'DESC')->findAll();

SELECT `investment_type`, `subdistrict`, SUM(additional_investment) as total
FROM `projects`
WHERE `upload_id` = 64
AND `subdistrict` IS NOT NULL
AND `subdistrict` != ''
GROUP BY `investment_type`, `subdistrict`
---
    public function getAdditionalInvestmentByDistrict($uploadId, $filters = [])
    {
        // For now, we'll use direct calculation with filters since pre-calculated stats don't support filtering
        $builder = $this->select('investment_type, subdistrict, SUM(additional_investment) as total')
            ->where('upload_id', $uploadId)
            ->where('subdistrict IS NOT NULL')
            ->where('subdistrict !=', '');

        if (!empty($filters['quarter']) && $filters['quarter'] !== 'all') {
            $builder->where('period_stage', $filters['quarter']);
        }

        $result = $builder->groupBy(['investment_type', 'subdistrict'])->findAll();

SELECT `company_name` AS `nama_perusahaan`, SUM(additional_investment) AS tambahan_realisasi, SUM(tki) AS jumlah_tki, SUM(tka) AS jumlah_tka, COUNT(DISTINCT project_id) AS jumlah_proyek
FROM `projects`
WHERE `investment_type` = 'PMA'
AND `company_name` IS NOT NULL
AND `company_name` != ''
AND `upload_id` IN ('PMA')
GROUP BY `company_name`
ORDER BY `company_name` ASC
---
    public function getSectorCountByCompany($uploadId, $filters = [])
    {
        log_message('debug', '=== getSectorCountByCompany START ===');
        log_message('debug', 'Upload ID: ' . (is_array($uploadId) ? json_encode($uploadId) : $uploadId));
        log_message('debug', 'Filters: ' . json_encode($filters));

        $getCompanyData = function ($investmentType) use ($uploadId, $filters) {
            $builder = $this->db->table($this->table)
                ->select('company_name AS nama_perusahaan,
                      SUM(additional_investment) AS tambahan_realisasi,
                      SUM(tki) AS jumlah_tki,
                      SUM(tka) AS jumlah_tka,
                      COUNT(DISTINCT project_id) AS jumlah_proyek')
                ->where('investment_type', $investmentType)
                ->where('company_name IS NOT NULL')
                ->where('company_name !=', '')
                ->groupBy('company_name')
                ->orderBy('company_name', 'ASC');

            // Jika upload_id adalah array, gunakan whereIn
            if (is_array($uploadId)) {
                $builder->whereIn('upload_id', $uploadId);
            } else {
                $builder->where('upload_id', $uploadId);
            }

            if (!empty($filters['quarter']) && $filters['quarter'] !== 'all') {
                $builder->where('period_stage', $filters['quarter']);
            }

            $result = $builder->get()->getResultArray();