app/Models/ProjectModel.php

    public function getStatisticsByUpload($uploadId)
    {
        $builder = $this->db->table('upload_statistics');
        return $builder->where('upload_id', $uploadId)->get()->getRowArray();
---
SELECT *
FROM `upload_statistics`
WHERE `upload_id` = 64

    public function getSectorStatistics($uploadId)
    {
        $builder = $this->db->table('sector_statistics');
        return $builder->where('upload_id', $uploadId)->get()->getResultArray();
---
SELECT *
FROM `sector_statistics`
WHERE `upload_id` = 64

    public function getProjectsByUpload($uploadId, $filters = [])
    {
        $builder = $this->where('upload_id', $uploadId);

        if (!empty($filters['quarter']) && $filters['quarter'] !== 'all') {
            $builder->where('period_stage', $filters['quarter']);
        }

        if (!empty($filters['year']) && $filters['year'] !== 'all') {
            // Note: period_stage contains quarter info, but we might need to filter by year if available
            // For now, we'll assume period_stage filtering is sufficient
        }

        return $builder->findAll();
---
SELECT *
FROM `projects`
WHERE `upload_id` = '64'

    public function getTotalProjects($uploadId, $filters = [])
    {
        // For now, we'll use direct calculation with filters since pre-calculated stats don't support filtering
        $builder = $this->select('investment_type, COUNT(*) as count')
            ->where('upload_id', $uploadId);

        if (!empty($filters['quarter']) && $filters['quarter'] !== 'all') {
            $builder->where('period_stage', $filters['quarter']);
        }

        $result = $builder->groupBy('investment_type')->findAll();
---
SELECT `investment_type`, COUNT(*) as count
FROM `projects`
WHERE `upload_id` = 64
GROUP BY `investment_type`

    public function getTotalInvestment($uploadId, $filters = [])
    {
        // For now, we'll use direct calculation with filters since pre-calculated stats don't support filtering
        $builder = $this->select('investment_type, SUM(total_investment) as total')
            ->where('upload_id', $uploadId);

        if (!empty($filters['quarter']) && $filters['quarter'] !== 'all') {
            $builder->where('period_stage', $filters['quarter']);
        }

        $result = $builder->groupBy('investment_type')->findAll();
---
SELECT `investment_type`, SUM(total_investment) as total
FROM `projects`
WHERE `upload_id` = 64
GROUP BY `investment_type`

    public function getAdditionalInvestment($uploadId, $filters = [])
    {
        // For now, we'll use direct calculation with filters since pre-calculated stats don't support filtering
        $builder = $this->select('investment_type, SUM(additional_investment) as total')
            ->where('upload_id', $uploadId);

        if (!empty($filters['quarter']) && $filters['quarter'] !== 'all') {
            $builder->where('period_stage', $filters['quarter']);
        }

        $result = $builder->groupBy('investment_type')->findAll();
---
SELECT `investment_type`, SUM(additional_investment) as total
FROM `projects`
WHERE `upload_id` = 64
GROUP BY `investment_type`

    public function getWorkforce($uploadId, $filters = [])
    {
        // For now, we'll use direct calculation with filters since pre-calculated stats don't support filtering
        $builder = $this->select('investment_type, SUM(tki) as tki, SUM(tka) as tka')
            ->where('upload_id', $uploadId);

        if (!empty($filters['quarter']) && $filters['quarter'] !== 'all') {
            $builder->where('period_stage', $filters['quarter']);
        }

        $result = $builder->groupBy('investment_type')->findAll();
---
SELECT `investment_type`, SUM(tki) as tki, SUM(tka) as tka
FROM `projects`
WHERE `upload_id` = 64
GROUP BY `investment_type`

    public function getProjectsByDistrict($uploadId, $filters = [])
    {
        // For now, we'll use direct calculation with filters since pre-calculated stats don't support filtering
        $builder = $this->select('investment_type, subdistrict, COUNT(*) as count')
            ->where('upload_id', $uploadId)
            ->where('subdistrict IS NOT NULL')
            ->where('subdistrict !=', '');

        if (!empty($filters['quarter']) && $filters['quarter'] !== 'all') {
            $builder->where('period_stage', $filters['quarter']);
        }

        $result = $builder->groupBy(['investment_type', 'subdistrict'])->findAll();
---
SELECT `investment_type`, `subdistrict`, COUNT(*) as count
FROM `projects`
WHERE `upload_id` = 64
AND `subdistrict` IS NOT NULL
AND `subdistrict` != ''
GROUP BY `investment_type`, `subdistrict`

    public function getInvestmentByDistrict($uploadId, $filters = [])
    {
        // For now, we'll use direct calculation with filters since pre-calculated stats don't support filtering
        $builder = $this->select('subdistrict, SUM(total_investment) as total')
            ->where('upload_id', $uploadId)
            ->where('subdistrict IS NOT NULL')
            ->where('subdistrict !=', '');

        if (!empty($filters['quarter']) && $filters['quarter'] !== 'all') {
            $builder->where('period_stage', $filters['quarter']);
        }

        $result = $builder->groupBy('subdistrict')->orderBy('total', 'DESC')->findAll();
---
SELECT `subdistrict`, SUM(total_investment) as total
FROM `projects`
WHERE `upload_id` = 61
AND `subdistrict` IS NOT NULL
AND `subdistrict` != ''
GROUP BY `subdistrict`
ORDER BY `total` DESC

    public function getWorkforceByDistrict($uploadId, $filters = [])
    {
        // For now, we'll use direct calculation with filters since pre-calculated stats don't support filtering
        $builder = $this->select('investment_type, subdistrict, SUM(tki) as tki, SUM(tka) as tka')
            ->where('upload_id', $uploadId)
            ->where('subdistrict IS NOT NULL')
            ->where('subdistrict !=', '');

        if (!empty($filters['quarter']) && $filters['quarter'] !== 'all') {
            $builder->where('period_stage', $filters['quarter']);
        }

        $result = $builder->groupBy(['investment_type', 'subdistrict'])->findAll();
---
SELECT `investment_type`, `subdistrict`, SUM(tki) as tki, SUM(tka) as tka
FROM `projects`
WHERE `upload_id` = 61
AND `subdistrict` IS NOT NULL
AND `subdistrict` != ''
GROUP BY `investment_type`, `subdistrict`

    public function getProjectsByCountry($uploadId, $filters = [])
    {
        // For now, we'll use direct calculation with filters since pre-calculated stats don't support filtering (PMA only)
        $builder = $this->select('country, COUNT(*) as count')
            ->where('upload_id', $uploadId)
            ->where('investment_type', 'PMA')
            ->where('country IS NOT NULL')
            ->where('country !=', '');

        if (!empty($filters['quarter']) && $filters['quarter'] !== 'all') {
            $builder->where('period_stage', $filters['quarter']);
        }

        $result = $builder->groupBy('country')->orderBy('count', 'DESC')->findAll();
---
SELECT `country`, COUNT(*) as count
FROM `projects`
WHERE `upload_id` = 61
AND `investment_type` = 'PMA'
AND `country` IS NOT NULL
AND `country` != ''
GROUP BY `country`
ORDER BY `count` DESC

    public function getRankingByDistrict($uploadId, $filters = [])
    {
        // For now, we'll use direct calculation with filters since pre-calculated stats don't support filtering
        $builder = $this->select('subdistrict, COUNT(*) as total_projects')
            ->where('upload_id', $uploadId)
            ->where('subdistrict IS NOT NULL')
            ->where('subdistrict !=', '');

        if (!empty($filters['quarter']) && $filters['quarter'] !== 'all') {
            $builder->where('period_stage', $filters['quarter']);
        }

        $result = $builder->groupBy('subdistrict')->orderBy('total_projects', 'DESC')->findAll();
---
SELECT `subdistrict`, COUNT(*) as total_projects
FROM `projects`
WHERE `upload_id` = 61
AND `subdistrict` IS NOT NULL
AND `subdistrict` != ''
GROUP BY `subdistrict`
ORDER BY `total_projects` DESC

    public function getQuarterlyResults($uploadId, $filters = [])
    {
        // For now, we'll use direct calculation with filters since pre-calculated stats don't support filtering
        $builder = $this->select('period_stage, COUNT(*) as count')
            ->where('upload_id', $uploadId)
            ->where('period_stage IS NOT NULL')
            ->where('period_stage !=', '');

        if (!empty($filters['quarter']) && $filters['quarter'] !== 'all') {
            $builder->where('period_stage', $filters['quarter']);
        }

        $result = $builder->groupBy('period_stage')->orderBy('period_stage')->findAll();
---
SELECT `period_stage`, COUNT(*) as count
FROM `projects`
WHERE `upload_id` = 61
AND `period_stage` IS NOT NULL
AND `period_stage` != ''
GROUP BY `period_stage`
ORDER BY `period_stage`

    public function getAdditionalInvestmentByDistrict($uploadId, $filters = [])
    {
        // For now, we'll use direct calculation with filters since pre-calculated stats don't support filtering
        $builder = $this->select('investment_type, subdistrict, SUM(additional_investment) as total')
            ->where('upload_id', $uploadId)
            ->where('subdistrict IS NOT NULL')
            ->where('subdistrict !=', '');

        if (!empty($filters['quarter']) && $filters['quarter'] !== 'all') {
            $builder->where('period_stage', $filters['quarter']);
        }

        $result = $builder->groupBy(['investment_type', 'subdistrict'])->findAll();
---
SELECT `investment_type`, `subdistrict`, SUM(additional_investment) as total
FROM `projects`
WHERE `upload_id` = 61
AND `subdistrict` IS NOT NULL
AND `subdistrict` != ''
GROUP BY `investment_type`, `subdistrict`

    public function getSectorCountByCompany($uploadId, $filters = [])
    {
        log_message('debug', '=== getSectorCountByCompany START ===');
        log_message('debug', 'Upload ID: ' . (is_array($uploadId) ? json_encode($uploadId) : $uploadId));
        log_message('debug', 'Filters: ' . json_encode($filters));

        $getCompanyData = function ($investmentType) use ($uploadId, $filters) {
            $builder = $this->db->table($this->table)
                ->select('company_name AS nama_perusahaan,
                      SUM(additional_investment) AS tambahan_realisasi,
                      SUM(tki) AS jumlah_tki,
                      SUM(tka) AS jumlah_tka,
                      COUNT(DISTINCT project_id) AS jumlah_proyek')
                ->where('investment_type', $investmentType)
                ->where('company_name IS NOT NULL')
                ->where('company_name !=', '')
                ->groupBy('company_name')
                ->orderBy('company_name', 'ASC');

            // Jika upload_id adalah array, gunakan whereIn
            if (is_array($uploadId)) {
                $builder->whereIn('upload_id', $uploadId);
            } else {
                $builder->where('upload_id', $uploadId);
            }

            if (!empty($filters['quarter']) && $filters['quarter'] !== 'all') {
                $builder->where('quarter', $filters['quarter']);
            }

            $result = $builder->get()->getResultArray();
---
SELECT `company_name` AS `nama_perusahaan`, SUM(additional_investment) AS tambahan_realisasi, SUM(tki) AS jumlah_tki, SUM(tka) AS jumlah_tka, COUNT(DISTINCT project_id) AS jumlah_proyek
FROM `projects`
WHERE `investment_type` = 'PMA'
AND `company_name` IS NOT NULL
AND `company_name` != ''
AND `upload_id` IN ('PMA')
GROUP BY `company_name`
ORDER BY `company_name` ASC