app/Models/UploadModel.php

SELECT *
FROM `uploads`
WHERE `quarter` = 'Q2'
AND `year` = '2025'
AND `status` != 'failed'
AND `status` != 'uploaded'
AND `id` != '34'
---
    public function checkDuplicateUpload($quarter, $year, $excludeId = null)
    {
        // Normalize quarter format - PASTIKAN SELALU FORMAT Q1, Q2, Q3, Q4
        $quarter = strtoupper(trim($quarter));
        if (!str_starts_with($quarter, 'Q')) {
            $quarter = 'Q' . $quarter;
        }

        // Log untuk debugging
        log_message('debug', "=== DUPLICATE CHECK START ===");
        log_message('debug', "Checking duplicate: Quarter={$quarter}, Year={$year}, ExcludeId={$excludeId}");

        // Query dengan kondisi yang jelas
        $builder = $this->db->table($this->table);
        $builder->where('quarter', $quarter);
        $builder->where('year', $year);

        // Cek semua status KECUALI 'failed' dan 'uploaded' (yang masih menunggu metadata)
        $builder->where('status !=', 'failed');
        $builder->where('status !=', 'uploaded');

        if ($excludeId !== null) {
            $builder->where('id !=', $excludeId);
        }

        $result = $builder->get()->getRowArray();

INSERT INTO `uploads` (`filename`, `original_filename`, `file_path`, `status`) VALUES ('1764989826_68b5c99727257cf81b53.xlsx', 'TW 3 Tanah Bumbu - Copy.xlsx', 'C:\\laragon\\www\\Sistem Statistik Terpadu - Copy\\writable\\uploads/1764989826_68b5c99727257cf81b53.xlsx', 'uploaded')
---
    public function createUpload($data)
    {
        // Don't check for duplicates at creation since metadata not yet filled
        return $this->insert($data);

UPDATE `uploads` SET `status` = 'completed', `total_records` = 455, `processed_records` = 455
WHERE `uploads`.`id` IN ('34')
---
    public function updateStatus($uploadId, $status, $additionalData = [])
    {
        $data = array_merge(['status' => $status], $additionalData);
        return $this->update($uploadId, $data);

SELECT *
FROM `uploads`
ORDER BY `upload_date` DESC
 LIMIT 1
---
    public function getLatestUpload()
    {
        return $this->orderBy('upload_date', 'DESC')->first();

SELECT *
FROM `uploads`
WHERE `uploads`.`id` = '34'
---
    public function getUploadById($uploadId)
    {
        return $this->find($uploadId);

SELECT *
FROM `uploads`
ORDER BY `upload_date` DESC
---
    public function getAllUploads()
    {
        return $this->orderBy('upload_date', 'DESC')->findAll();