app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'superadmin'
OR `email` = 'superadmin'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getUserByUsernameOrEmail($identifier)
    {
        return $this->where('username', $identifier)
            ->orWhere('email', $identifier)
            ->first();

UPDATE `users` SET `last_login` = '2025-12-08 08:59:55', `updated_at` = '2025-12-08 08:59:55'
WHERE `users`.`id` IN ('1')
---
    public function updateLastLogin($userId)
    {
        return $this->update($userId, ['last_login' => date('Y-m-d H:i:s')]);

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `users`.`deleted_at` IS NULL
---
    public function getAllUsers($page = 1, $perPage = 10)
    {
        return $this->paginate($perPage, 'default', $page);